#include <stdio.h>

/*
Все нечетные
Дана последовательность целых чисел через пробел, завершающаяся числом 0.
Выведите все нечетные числа из этой последовательности, сохраняя их порядок.
Составить рекурсивную функцию.
Формат входных данных
Последовательность не нулевых целых чисел. В конце число 0.

Формат результата
Введенная последовательность, кроме четных чисел в том же порядке.
Число 0 не выводить.

Примеры
Входные данные
12 13 173 28 19 0
Результат работы
13 173 19
*/


int even_print()
{
    int currentDigit;
    scanf("%d", &currentDigit);
    if (currentDigit == 0)
        return 0;
    if ((currentDigit % 2) != 0)
        printf("%d ", currentDigit);
    return even_print();

}


int main()
{
    even_print();
    return 0;
}


