#include <stdio.h>

/*
От 1 до N
Составить рекурсивную функцию, печать всех чисел от N до 1.
Формат входных данных
Одно натуральное число
Формат результата
Последовательность целых чисел от введенного числа до 1, через пробел.
Примеры
Входные данные
5
Результат работы
5 4 3 2 1
*/

void printFunc(int i, int n)
{

    if (i > n)
        return;
    printFunc(i+1, n);
    printf("%d ", i);
}

int main()
{
    int n, i=1;
    scanf("%d", &n);
    printFunc(i, n);
    return 0;
}
