#include <stdio.h>
#include <inttypes.h>

/*
Все счастливые числа
Ввести натурально число и напечатать все числа от 10 до введенного числа
- у которых сумма цифр равна произведению цифр

Формат входных данных
Одно натуральное число большее 10

Формат результата
Числа у которых сумма цифр равна произведению цифр через пробел в порядке
возрастания. Не превосходящие введенное число.

Примеры

Входные данные
200
Результат работы
22 123 132

Входные данные
1000
Результат работы
22 123 132 213 231 312 321

Входные данные
22
Результат работы
22
*/


//~ int main(void)
//~ {
    //~ int happyNumber[100];
    //~ int happyCount = 0;
    //~ int numberDigits, count = 0;
    //~ int number;
    //~ scanf("%" SCNu32, &number);

    //~ numberDigits = number;
    //~ while (numberDigits != 0)
    //~ {
        //~ numberDigits = numberDigits / 10;
        //~ count++;
    //~ };

    //~ int digit[count];
    //~ for (int n = 1; n <= count; n++)
    //~ {
        //~ digit[n] = number % 10;
        //~ number = number / 10;
    //~ }


    //~ if (count == 2)
    //~ {
        //~ for (int a = 1; a <= count; a++)
        //~ {
            //~ for (int b = 1; b <= count; b++)
            //~ {
                //~ if ((digit[a] * digit[b]) == (digit[a] + digit[b]))
                //~ {
                    //~ happyCount +=1;

                //~ }

            //~ }
        //~ }
    //~ }






    //~ printf("%d ", even);
    //~ printf("%d\n", noteven);

    //~ return 0;
//~ }

